# core
brew "mas"
cask "alfred"
cask "alienator88/homebrew-cask/sentinel-app"

# cli tools
tap "remotemobprogramming/brew"
tap "jesseduffield/lazygit"
brew "git"
brew "curl"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "neovim"
brew "sevenzip"
brew "tmux"
brew "stow"
cask "alacritty"

# infra
brew "argocd"
brew "helm"
brew "kubernetes-cli"

# programming
cask "dbeaver-community"
cask "docker"
cask "figma"
brew "nvm"
brew "openjdk"
cask "postman"
cask "powershell"
brew "python@3.13"
brew "remotemobprogramming/brew/mob"
cask "rider"
brew "rustup"
cask "rustrover"
cask "visual-studio-code"
mas "Xcode", id: 497799835

# system
cask "1password"
cask "alt-tab"
cask "appcleaner"
cask "chatgpt"
cask "cyberduck"
cask "displaylink"
cask "elgato-camera-hub"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "elgato-wave-link"
cask "firefox"
cask "inkscape"
cask "kap"
cask "keka"
cask "keepassxc"
cask "obsidian"
cask "ollama"
cask "sentinel-app"
cask "symboliclinker"
cask "the-unarchiver"
cask "utm"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Calendar 366 II", id: 1265895169
mas "Command X", id: 6448461551
mas "Disk Space Analyzer", id: 446243721
mas "Hidden Bar", id: 1452453066
mas "HP Smart", id: 1474276998
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466

# multimedia
cask "deadbeef@nightly"
brew "ffmpeg"
cask "gimp"
cask "iina"
cask "obs"
cask "stremio"
brew "yt-dlp"
cask "vlc"
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434

# communication
cask "discord"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "slack"

# gaming
cask "crossover"
cask "dolphin"
cask "heroic"
cask "nvidia-geforce-now"
cask "retroarch-metal"
cask "scummvm"
cask "steam"
cask "whisky"

